#+property: header-args :flags -std=c++20 -Wall -Wextra
#+title: 31251 Data Structures and Algorithms Tutorial
#+author: Euan Mendoza
#+email: euan.mendoza@uts.edu.au
#+date: Week 02
** Static Arrays
Arrays in C++ can either be /static/ (created on the stack), or /dynamic/ (created on the heap).

#+begin_src C++ :tangle 01_c_arrays/static_arr.cpp :mkdirp yes :results output
#include <iostream>

// here is an example of a dynamic array
int main() {
	// sizes of array needs to be known at compile time
	int arr[2] = {1, 2};

	std::cout << "Number 1: " << arr[0] << std::endl;
	std::cout << "Number 2: " << arr[1] << std::endl;

	// can change array contents
	arr[1] = 30;
	std::cout << "Number 1: " << arr[0] << std::endl;
	std::cout << "Number 2: " << arr[1] << std::endl;

	// at the end of the scope, the array will safely be popped from the
	// stack
}
#+end_src

#+RESULTS:
: Number 1: 1
: Number 2: 2
: Number 1: 1
: Number 2: 30

Notice how in the previous code, the size of the array needed to be specified at compile time.

What are the pros and cons?

* First C++ Program
Here is the classic /Hello World!/ program in C++.

#+begin_src C++ :main no :tangle 01_hello_world/hello_world.cpp :mkdirp yes
// We include the iostream library.
// This library contains the declaration of
// the cout object.
#include <iostream>

int main() {
    // Standard library objects are put in a "namespace" called std.
    // This is to avoid name collisions with names we define.
    // To refer to objects in the std namespace we use the scope resolution
    // operator ::, as in std::cout
    std::cout << "Hello World\n";
    return 0;
}
#+end_src

#+RESULTS:
: Hello World

